import {
  mobile,
  backend,
  creator,
  web,
  corona,
  vray,
  blender,
  threedmax,
  unrealeng,
  marvelous,
  zbrush,
  photoshop,
  substance,
  illustrator,
  sketchup,
  unity,
  hello,
  workme,
  response,
  loveyou,
  coreldraw,
  cottage,
  interior,
  kitchen,
  client1,
  client2,
  client3,
  livingroom,
  cottageindetails,
  modularHouse,
  interiorForDesigner,
  moduleMovieTheater,
  inartdesign,
  cabinonalake,
  cottagebyrefference,
  chairmodeling,
  sofaModeling,
  kworkIcon,
  linkedinIcon,
  behanceIcon,
  upworkIcon,
} from '../assets';

const herotext = {
  hitext: 'გამარჯობა! მე ',
  nametext: 'ნატალი ვარ!',
  learnMore: 'შეიტყვეთ მეტი',
  myintro: [
    'მე ვამუშავებ 3D ვიზუალიზაციას, მოდელებსა',
    'და სცენებს თქვენი საწარმოებისთვის, ',
    'პროექტებისთვის და ოცნებებისთვის.',
  ],
  about: ['ბევრ კლიენტთან ვიმუშავე', 'და გზაში ბევრი უნარ-ჩვევები აითვისე'],
  socials: ['სხვათა შორის, აქ არის ჩემი კონტაქტები, ', 'Upwork-იც არის, სწრაფად ვპასუხობ :)'],
  portfolio: ['წლების განმავლობაში წარმართა მრავალი პროექტი წარმატებისკენ', 'გაინტერესებთ ზოგიერთი?', 'ეწვიეთ პორტფოლიოს'],
  reviews: ['გაიგე რას ფიქრობენ ჩემი კლიენტები!', 'ჩვენებები'],
  experience: ['ცოტა (ან ბევრი) სასარგებლო ჩემს საქმიანობაში...'],
  readytowork: ['ახლა მე მზად ვარ განვიხილო შენი დავალება', 'და შეუდგე მუშაობას...', 'დამიკავშირდით']
};

const navLinks = [
  {
    about: 'Ჩემს შესახებ',
  },
  {
    work: 'პორტფოლიო',
  },
  {
    contact: 'კავშირი',
  },
];

const intro = {
  introheader1: ' ჩემი გაცნობა',
  introheader2: 'მიმოხილვა',
  introtext:
    'მე ვარ გამოცდილი 3D დეველოპერი, რომელსაც აქვს გამოცდილება 3ds max, Blender, Unreal Engine და სხვა დეველოპერულ სისტემებში. მე ვარ სწრაფი შემსწავლელი და მჭიდროდ ვთანამშრომლობ კლიენტებთან, რათა შევქმნა მაღალი ხარისხის ვიზუალიზაცია, რომელიც აკმაყოფილებს ღრმა პროფესიულ სტანდარტებს და გადაჭრის რეალურ ამოცანებს. მოდით, ერთად ვიმუშაოთ თქვენი ოცნებებისა და იდეების რეალიზებისთვის.',
};

const services = [
  {
    title: 'ექსტერიერის 3D ვიზუალიზაცია',
    icon: web,
  },
  {
    title: 'ინტერიერის 3D ვიზუალიზაცია',
    icon: mobile,
  },
  {
    title: '3D მოდელირება',
    icon: backend,
  },
  {
    title: 'თამაშის განვითარება',
    icon: creator,
  },
];

const technologiesHeader = {
  mySkills: 'ჩემი უნარები...'
}

const technologies = [
  {
    name: '3Ds max',
    icon: threedmax,
    anotation:
      'Autodesk 3ds Max, ადრე 3D Studio და 3D Studio Max, არის პროფესიონალური 3D კომპიუტერული გრაფიკის პროგრამა 3D ანიმაციების, მოდელების, თამაშებისა და სურათების შესაქმნელად. ის შემუშავებულია და დამზადებულია Autodesk Media and Entertainment-ის მიერ.',
  },
  {
    name: 'Corona render',
    icon: corona,
    anotation:
      'Chaos Corona არის კომპიუტერული გენერირებული გამოსახულების 3D რენდერის პროგრამა, რომელიც შემუშავებულია Chaos Czech-ის მიერ, Chaos-ის შვილობილი კომპანიის მიერ. იგი შეიქმნა ონდრეი კარლიკის მიერ, როგორც სტუდენტური პროექტი 2009 წელს და შეიქმნა პრაღაში დაფუძნებული კომპანია Render Legion-ის მიერ Corona Renderer-ის სახელწოდებით. 2017 წელს Chaos Group-მა შეიძინა Render Legion, მოგვიანებით კი კომპანია Chaos Czech-ის რებრენდინგით. 2022 წელს Corona Renderer გადაკეთდა Chaos Corona-ზე.',
  },
  {
    name: 'VRay render',
    icon: vray,
    anotation:
      'V-Ray არის მიკერძოებული კომპიუტერული გენერირებული გამოსახულების გადაცემის პროგრამული პროგრამა, რომელიც შემუშავებულია ბულგარული პროგრამული უზრუნველყოფის კომპანია Chaos-ის მიერ. V-Ray არის კომერციული დანამატი მესამე მხარის 3D კომპიუტერული გრაფიკის პროგრამული უზრუნველყოფისთვის და გამოიყენება ვიზუალიზაციისთვის და კომპიუტერული გრაფიკისთვის ისეთ ინდუსტრიებში, როგორიცაა მედია, გასართობი, ფილმების და ვიდეო თამაშების წარმოება, ინდუსტრიული დიზაინი, პროდუქტის დიზაინი და არქიტექტურა.',
  },
  {
    name: 'Blender',
    icon: blender,
    anotation:
      'Blender, ზოგჯერ სტილიზებული, როგორც Blender, არის უფასო და ღია კოდის 3D კომპიუტერული გრაფიკის პროგრამული უზრუნველყოფის ხელსაწყოების ნაკრები, რომელიც გამოიყენება ანიმაციური ფილმების, ვიზუალური ეფექტების, ხელოვნების, 3D-დაბეჭდილი მოდელების, მოძრაობის გრაფიკის, ინტერაქტიული 3D აპლიკაციების, ვირტუალური რეალობის შესაქმნელად და ადრე, ვიდეო თამაშები. ბლენდერების ფუნქციები მოიცავს 3D მოდელირებას, UV რუკებს, ტექსტურირებას, ციფრულ ნახატს, რასტრული გრაფიკის რედაქტირებას, გაყალბებასა და კანს, სითხისა და კვამლის სიმულაციას, ნაწილაკების სიმულაციას, რბილი სხეულის სიმულაციას, ქანდაკებას, ანიმაციას, მატჩის გადაადგილებას, რენდერირებას, მოძრაობის გრაფიკას, ვიდეო რედაქტირებას და კომპოზიცია.',
  },
  {
    name: 'Unreal Engine',
    icon: unrealeng,
    anotation:
      'Unreal Engine (UE) არის 3D კომპიუტერული გრაფიკული თამაშების ძრავების სერია, რომელიც შემუშავებულია Epic Games-ის მიერ, რომელიც პირველად იქნა წარმოდგენილი 1998 წელს პირველი პირის შუტერის ვიდეო თამაშში Unreal. თავდაპირველად შემუშავებული იყო PC პირველი პირის შუტერებისთვის, მას შემდეგ ის გამოიყენებოდა თამაშების სხვადასხვა ჟანრში და მიიღეს სხვა ინდუსტრიებში, განსაკუთრებით კინოსა და ტელევიზიის ინდუსტრიაში. Unreal Engine დაწერილია C++-ში და აქვს პორტაბელურობის მაღალი ხარისხი, მხარს უჭერს დესკტოპის, მობილურის, კონსოლის და ვირტუალური რეალობის პლატფორმების ფართო სპექტრს.',
  },
  {
    name: 'Marvelous Designer',
    icon: marvelous,
    anotation:
      'ინდუსტრიის სტანდარტი ვირტუალური ტანსაცმლის აქტივების შესაქმნელად თამაშის, VFX, დიზაინისა და არქიტექტურის ინდუსტრიებისთვის.',
  },
  {
    name: 'ZBrush',
    icon: zbrush,
    anotation:
      'Pixologic ZBrush არის ციფრული ქანდაკების ინსტრუმენტი, რომელიც აერთიანებს 3D/2.5D მოდელირებას, ტექსტურირებას და ფერწერას. იგი იყენებს საკუთრებაში არსებულ "pixol" ტექნოლოგიას, რომელიც ინახავს განათებას, ფერს, მასალას, ორიენტაციას და სიღრმის ინფორმაციას ეკრანზე არსებული ყველა ობიექტის შემადგენელი წერტილებისთვის. მთავარი განსხვავება ZBrush და უფრო ტრადიციული მოდელირების პაკეტებს შორის არის ის, რომ ის უფრო მეტად ჰგავს ტრადიციულ ქანდაკებას.',
  },
  {
    name: 'Substance Painter',
    icon: substance,
    anotation:
      'Substance 3D Painter არის 3D ფერწერის პროგრამული უზრუნველყოფა, რომელიც მომხმარებლებს საშუალებას აძლევს ტექსტურა და დაამატოთ მასალები პირდაპირ 3D ბადეებში რეალურ დროში.',
  },
  {
    name: 'Adobe Photoshop',
    icon: photoshop,
    anotation:
      'Adobe Photoshop არის რასტრული გრაფიკული რედაქტორი, რომელიც შემუშავებულია და გამოქვეყნებულია Adobe Inc.-ის მიერ Windows-ისთვის და macOS-ისთვის. იგი თავდაპირველად შეიქმნა 1987 წელს თომას და ჯონ კნოლების მიერ. მას შემდეგ პროგრამული უზრუნველყოფა გახდა ყველაზე ხშირად გამოყენებული ინსტრუმენტი პროფესიონალური ციფრული ხელოვნებისთვის, განსაკუთრებით რასტრული გრაფიკის რედაქტირებისთვის. პროგრამული უზრუნველყოფის სახელი ხშირად გამოიყენება სასაუბროდ, როგორც ზმნა (მაგ. "სურათის ფოტოშოპი", "ფოტოშოპინგი" და "ფოტოშოპის კონკურსი")[6] თუმცა Adobe ხელს უშლის ასეთ გამოყენებას.',
  },
  {
    name: 'Adobe Illustrator',
    icon: illustrator,
    anotation:
      'Adobe Illustrator-ის შემუშავება Apple Macintosh-ისთვის დაიწყო 1985 წელს[2] (მიწოდება 1987 წლის იანვარში) როგორც Adobe-ის შიდა შრიფტის განვითარების პროგრამული უზრუნველყოფის კომერციალიზაცია და PostScript ფაილის ფორმატი. Adobe Illustrator არის Adobe Photoshop-ის კომპანიონი პროდუქტი. Photoshop ძირითადად მიმართულია ციფრული ფოტო მანიპულაციისა და კომპიუტერული ილუსტრაციის ფოტორეალისტური სტილისკენ, ხოლო Illustrator იძლევა შედეგებს დიზაინის აკრეფისა და ლოგოს გრაფიკულ სფეროებში.',
  },
  {
    name: 'Corel Draw',
    icon: coreldraw,
    anotation:
      'CorelDRAW არის ვექტორული გრაფიკის რედაქტორი, რომელიც შემუშავებულია და გაყიდულია Alludo-ს (ყოფილი Corel Corporation) მიერ. ეს ასევე არის Corel-ის გრაფიკული ნაკრების სახელი, რომელიც მოიცავს ბიტმაპ-იმიჯის რედაქტორს Corel Photo-Paint-ს, ისევე როგორც სხვა გრაფიკასთან დაკავშირებულ პროგრამებს (იხ. ქვემოთ). ის შეიძლება იყოს ციფრული ფერწერის პლატფორმა, დესკტოპის საგამომცემლო კომპლექტი და ჩვეულებრივ გამოიყენება წარმოების ხელოვნებისთვის ნიშნების დამზადებაში, ვინილისა და ლაზერული ჭრისა და გრავიურის, ბეჭდვის მოთხოვნაზე და სხვა ინდუსტრიულ პროცესებში. ასევე შემოთავაზებულია შემცირებული ფუნქციების Standard და Essentials ვერსიები.',
  },
  {
    name: 'SketchUp',
    icon: sketchup,
    anotation:
      'SketchUp არის სააბონენტო პროდუქტების კომპლექტი, რომელიც მოიცავს SketchUp Pro Desktop-ს, 3D მოდელირების კომპიუტერის დამხმარე დიზაინს (CAD) პროგრამას ნახატებისა და დიზაინის ფართო სპექტრისთვის - მათ შორის არქიტექტურული, ინტერიერის დიზაინი, სამრეწველო და პროდუქტის დიზაინი, ლანდშაფტის არქიტექტურა, სამოქალაქო და მექანიკური ინჟინერია, თეატრის, კინოსა და ვიდეო თამაშების განვითარება.',
  },
  {
    name: 'Unity',
    icon: unity,
    anotation:
      'Unity არის კროს-პლატფორმული თამაშის ძრავა, რომელიც შეიქმნა Unity Technologies-ის მიერ, რომელიც პირველად გამოცხადდა და გამოვიდა 2005 წლის ივნისში Apple Worldwide Developers Conference-ზე, როგორც Mac OS X თამაშის ძრავა. მას შემდეგ ძრავა თანდათან გაფართოვდა დესკტოპის, მობილურის, კონსოლისა და ვირტუალური რეალობის სხვადასხვა პლატფორმის მხარდასაჭერად. ის განსაკუთრებით პოპულარულია iOS და Android მობილური თამაშების შემუშავებისთვის, ითვლება მარტივი გამოსაყენებლად დამწყები დეველოპერებისთვის და პოპულარულია ინდი თამაშების განვითარებისთვის.',
  },
];

const experience_header = ['ჩვენი მომავალი თანამშრომლობის ძირითადი პუნქტები', 'ხელოსნობა და შედეგი', 'Დამიჭირე მხარი!']

const experiences = [
  {
    title: 'Დამიკავშირდი...',
    action_name: 'საკონტაქტო ფორმა ',
    icon: hello,
    iconBg: '#E6DEDD',
    date: 'ნაბიჯი - №1',
    points: [
      'გააკეთეთ თქვენი მოთხოვნა, აღწერეთ თქვენი დავალება, რა არის თქვენი ვადები, ბიუჯეტის მოთხოვნები.',
      'გთხოვთ, დარწმუნდით, რომ გაქვთ მსგავსი სამუშაოს მაგალითები: მსგავსი ინტერიერის ფოტო, მსგავსი მოდელები, შენობები ან სხვა.',
      'თუ მხოლოდ ჩემი კონსულტაცია გჭირდებათ, თავისუფლად ითხოვეთ.',
      'შეგიძლიათ მომყვეთ სოციალურ მედიაში და ასევე დამიკავშირდით მესინჯერებში.',
    ],
  },
  {
    title: 'ჩემი პასუხი',
    action_name: 'მიიღეთ ჩემი კონსულტაცია ან/და სპეციფიკაციები',
    icon: response,
    iconBg: '#E6DEDD',
    date: 'ნაბიჯი - №2',
    points: [
      'რაც შეიძლება მალე გიპასუხებ. მიიღეთ ჩემი შეფასებები პროექტის შესახებ, კონსულტაცია მის ბიუჯეტზე და ვადებზე.',
      'ჩემი სრული მხარდაჭერით ჩვენ შევასრულებთ შესაბამის ტექნიკურ დავალებას.',
      'განვიხილავთ პროექტის ნიუანსებს, მის სპეციფიკას, უკეთ გაიგებთ სამუშაოს მიმდინარეობას.',
      'თუ უკვე გაქვთ საკუთარი მითითების პირობები - გამომიგზავნეთ, ეს დააჩქარებს პროცესს.',
    ],
  },
  {
    title: 'დავიწყოთ ჩვენი მუშაობა',
    action_name: 'კოორდინაცია და შედეგი.',
    icon: workme,
    iconBg: '#E6DEDD',
    date: 'ნაბიჯი - №3',
    points: [
      'მე ვარ პროექტების ძალიან ფართო სპექტრისთვის. ჩემი პროფესიული კავშირებიდან გამომდინარე, შემიძლია სწრაფად ჩამოვაყალიბო გუნდი თითქმის ნებისმიერი ამოცანისთვის.',
      'თანამშრომლობა მრავალფუნქციურ გუნდებთან, მათ შორის დიზაინერებთან, პროდუქტის მენეჯერებთან და სხვა დეველოპერებთან მაღალი ხარისხის შედეგის შესაქმნელად.',
      'ორიგინალური დიზაინის დანერგვა და კულტურული და საერთაშორისო მრავალფეროვნების გათვალისწინება.',
      'ტექნიკური საკითხების გადაჭრა და კონსულტაცია სამუშაოს ყველა ასპექტზე, კონსტრუქციული უკუკავშირის მიწოდება თქვენთვის და თქვენი გუნდისთვის.',
    ],
  },
  {
    title: 'გთხოვთ გამოიწეროთ',
    action_name: 'მიიღეთ უპირატესობები და დამატებები',
    icon: loveyou,
    iconBg: '#E6DEDD',
    date: 'ნაბიჯი - №4',
    points: [
      'გამომყევი Boosty.to-ზე. თქვენ შეგიძლიათ მიიღოთ პრიორიტეტი თქვენს შეკვეთებზე. ფაილების წყარო, მხარდაჭერა და კონსულტაციები მუდმივ საფუძველზე',
      'მე ვაძლევ მნიშვნელოვან ფასდაკლებებს ჩემი აბონენტებისთვის ვირტუალურ ექსკურსიებზე, მოდელებზე და პროექტების სხვა დამატებებზე',
      'დასრულებული სამუშაოების უფასო შეკეთება (ჩვენს ხელშეკრულებაზე გამოყენებული სია).',
      'დააჭირეთ ხატულას და მიიღეთ ყველა უპირატესობა თქვენი პირველი შეკვეთით.',
    ],
  },
];

const testimonials_text = {
  what_others_say: 'რას ამბობენ სხვები?',
  testiomnials_text: 'ჩვენებები...',
  testimonials_promt: 'მე ვმუშაობდი ყველა სახის კლიენტთან, გავაუმჯობესე ჩემი უნარები და გავერთიანდი ჭკვიან ადამიანებთან. აი რამდენიმე გამოხმაურება...'
};

const testimonials = [
  {
    testimonial:
      'ვფიქრობდი, რომ შეუძლებელი იყო ინტერიერის გაკეთება ისეთი ლამაზი, როგორიც წარმომედგინა, მაგრამ ნატალიმ დაამტკიცა, რომ ვცდები.',
    name: 'ნაზილ სვანიძე',
    designation: 'დიზაინერი',
    company: 'Self employed',
    image: client1,
  },
  {
    testimonial:
      'მე არასოდეს შემხვედრია დეველოპერი, რომელიც ნამდვილად ზრუნავს თავის კლიენტებზე, როგორც ამას ნატალი აკეთებს.',
    name: 'ევგენი სუხარნიკოვი',
    designation: 'IE',
    company: 'Batumi Bottom',
    image: client2,
  },
  {
    testimonial:
      'მას შემდეგ, რაც ნატალიმ ჩვენი პირველი კოტეჯის ვიზუალიზაცია მოახდინა, ჩვენ მუდმივად ვმუშაობთ მასთან და მის გუნდთან ერთად. სწრაფი შედეგი და მაქსიმალური ტექნიკური გაგება. იშვიათია.',
    name: 'ლიზა ბლოკი',
    designation: 'CTO',
    company: 'First development',
    image: client3,
  },
];

const work_text = {
  my_work_header: 'ჩემი ',
  my_work_header1: 'პროექტები...',
  my_work_intro:
    'შემდეგი პროექტები აჩვენებენ ჩემს უნარებსა და გამოცდილებას ჩემი ნამუშევრების რეალურ სამყაროში მაგალითებით. თითოეული პროექტი მოკლედ არის აღწერილი და მასში ცოცხალი დემო. ეს ასახავს ჩემს უნარს, გადაჭრას რთული პრობლემები, ვიმუშაო სხვადასხვა ტექნოლოგიებით და ეფექტურად ვმართო პროექტები.',
};

const projects = [
  {
    name: 'ავეჯის მოდელირება, დივანი, ინტერიერისთვის.',
    description: 'ნებისმიერი ავეჯის მოდელირება შეკვეთით ნახაზებისა და რეფერენსების მიხედვით. დეტალებისადმი ყურადღება და პროფესიონალური შედეგები. ნებისმიერი ფორმატი და ადაპტაცია ნებისმიერი გამოყენებისთვის :)',
    tags: [
      {
        name: 'ავეჯი',
        color: 'blue-text-gradient',
      },
      {
        name: 'ვიზუალიზაცია',
        color: 'green-text-gradient',
      },
      {
        name: 'მოდელირება',
        color: 'pink-text-gradient',
      },
    ],
    image: sofaModeling,
    source_code_link: 'https://www.behance.net/gallery/187794293/modelirovanie-3D-divana',
  },  
  {
    name: "ავეჯის მოდელირება, სკამი, რთული დიზაინი",
    description: "ნებისმიერი ავეჯის მოდელირება შეკვეთით ნახაზებისა და რეფერენსების მიხედვით. დეტალებისადმი ყურადღება და პროფესიონალური შედეგები. ნებისმიერი ფორმატი და ადაპტაცია ნებისმიერი გამოყენებისთვის :)",
    tags: [
      {
        name: "ავეჯი",
        color: "blue-text-gradient",
      },
      {
        name: "ვიზუალიზაცია",
        color: "green-text-gradient",
      },
      {
        name: "მოდელირება",
        color: "pink-text-gradient",
      },
    ],
    image: chairmodeling,
    source_code_link: "https://www.behance.net/gallery/191756637/Chair-modeling",
  },
  {
    name: "ოთახის ვიზუალიზაცია ზღვის პირას",
    description: "ჩემი ერთ-ერთი პირველი ნამუშევარი. ეს ვიზუალი საჭირო იყო ჩემი ანგარიშისთვის. ძალიან საინტერესო გამოვიდა :)",
    tags: [
      {
        name: "ინტერიერი",
        color: "blue-text-gradient",
      },
      {
        name: "ვიზუალიზაცია",
        color: "green-text-gradient",
      },
      {
        name: "მოდელირება",
        color: "pink-text-gradient",
      },
    ],
    image: interiorForDesigner,
    source_code_link: "https://www.behance.net/gallery/170836005/Visualization-of-a-room-in-a-house-by-the-sea",
  },  
  {
    name: "Barton Hills-ის რეზიდენციის ვიზუალიზაცია ოსტინში, ტეხასი, რეფერენსული ნამუშევარი",
    description: "პოპულარული ფოტო ინტერნეტში, რომელმაც ასევე მიმიზიდა ხის, მინისა და ფოლადის ჰარმონიული კომბინაციით და თბილი და ცივი ტონების კონტრასტით.",
    tags: [
      {
        name: "ექსტერიერი",
        color: "blue-text-gradient",
      },
      {
        name: "ვიზუალიზაცია",
        color: "green-text-gradient",
      },
      {
        name: "მოდელირება",
        color: "pink-text-gradient",
      },
    ],
    image: cottagebyrefference,
    source_code_link: "https://www.behance.net/gallery/180671299/rezidencija-Barton-Hills",
  },  
  {
    name: "ატმოსფერული ექსტერიერი - ტბის სახლი",
    description: "მყუდრო კოტეჯი ტბის ნაპირზე, ტყის სიღრმეში. ასეთი ფოტოს გადაღება ძალიან ძვირია, მაგრამ არსებობს ალტერნატივა - მიმართოთ ვიზუალიზატორს, რომელიც შეიძლება ფოტოზე უკეთესიც კი შექმნას.",
    tags: [
      {
        name: "ექსტერიერი",
        color: "blue-text-gradient",
      },
      {
        name: "ვიზუალიზაცია",
        color: "green-text-gradient",
      },
      {
        name: "მოდელირება",
        color: "pink-text-gradient",
      },
    ],
    image: cabinonalake,
    source_code_link: "https://www.behance.net/gallery/175309075/domik-v-tumane",
  },  
  {
    name: "მოდულური სახლის მინი-თეატრის პროექტი",
    description: "კომპანია, რომელიც აწარმოებს მოდულურ სახლებს, აფართოებს თავის ასორტიმენტს მინი-თეატრებით. კატალოგისთვის საჭირო იყო ვიზუალიზაციები, რომლებიც მე მოკლე დროში შევასრულე. ავეჯის, ნახატების და სხვა დეტალების შერჩევა ზოგჯერ დიდ დროს მოითხოვს, მაგრამ ჩემი გამოცდილება საშუალებას მაძლევს სწრაფად გადავწყვიტო ეს ამოცანა, თუნდაც ნულიდან მოდელირება იყოს საჭირო.",
    tags: [
      {
        name: "ინტერიერი",
        color: "blue-text-gradient",
      },
      {
        name: "ვიზუალიზაცია",
        color: "green-text-gradient",
      },
      {
        name: "მოდელირება",
        color: "pink-text-gradient",
      },
    ],
    image: moduleMovieTheater,
    source_code_link: "https://www.behance.net/gallery/192381607/3D-visualization-of-the-interior-of-a-modular-home",
  },
  {
    name: "ინტერიერის ვიზუალიზაცია Inart.studio დიზაინ სტუდიისთვის",
    description: "დიზაინ სტუდიამ მოგვმართა კლიენტის ბინის ინტერიერის ეტაპობრივი ვიზუალიზაციისთვის. ჩვენ დავიწყეთ დერეფნით, სადაც სწრაფად შევთანხმდით ყველა მასალასა და მათ ფერებზე. ასევე მიღწეული იყო სრული ურთიერთგაგება კლიენტთან შემდგომი სამუშაოების ეტაპებისთვის.",
    tags: [
      {
        name: "ინტერიერი",
        color: "blue-text-gradient",
      },
      {
        name: "ვიზუალიზაცია",
        color: "green-text-gradient",
      },
      {
        name: "მოდელირება",
        color: "pink-text-gradient",
      },
    ],
    image: inartdesign,
    source_code_link: "https://www.behance.net/gallery/202638697/prihozhaja-Nemo",
  },
  {
    name: "მოდულური სახლის ინტერიერის ვიზუალიზაცია",
    description: "კომპანია, რომელიც ქმნის მოდულურ სახლებს, მოგვმართა, რომ შევქმნათ ფერადი ვიზუალიზაციები მათი კატალოგებისთვის. ავეჯის მასალები, შუშის ინტერიერის დეტალები და ხედი ფანჯრიდან ყველა უნდა აკმაყოფილებდეს მაღალ სტანდარტებს. ასევე გამოყენებულია პოსტ-დამუშავება Adobe Photoshop-ში.",
    tags: [
      {
        name: "მოდულური სახლი",
        color: "blue-text-gradient",
      },
      {
        name: "ინტერიერი",
        color: "green-text-gradient",
      },
      {
        name: "მშენებლობა",
        color: "pink-text-gradient",
      },
    ],
    image: modularHouse,
    source_code_link: "https://www.behance.net/gallery/203657751/3D-visualization-of-the-interior-of-a-modular-house",
  },
  {
    name: "საცხოვრებელი ოთახის ვიზუალიზაცია",
    description: "ეს პროექტი იყენებს მოწინავე განათების ტექნიკას ბუნებრივი და სასიამოვნო ატმოსფეროს შესაქმნელად. ვიზუალიზაცია აჩვენებს მყუდრო და ფუნქციურ სივრცეს, რომელიც იდეალურია კომფორტული ცხოვრებისათვის.",
    tags: [
      {
        name: "ოთახი",
        color: "blue-text-gradient",
      },
      {
        name: "ინტერიერი",
        color: "green-text-gradient",
      },
      {
        name: "დიზაინი",
        color: "pink-text-gradient",
      },
    ],
    image: livingroom,
    source_code_link: "https://www.behance.net/gallery/204735049/Living-room-visualization",
  },  
  {
    name: 'კოტეჯი ყველა დეტალში',
    description:
      'კოტეჯის დეტალური 3D მოდელი, რომელიც დაფუძნებულია არქიტექტურულ პროექტზე. რეალისტური რენდერი, რომლისთვისაც მასალები საგულდაგულოდ იყო შემუშავებული, რათა ასახავდეს დიზაინერის განზრახვას და ეჩვენებინა მისი იდეების სარგებელი რეალური კლიენტისთვის.',
    tags: [
      {
        name: 'კოტეჯი',
        color: 'blue-text-gradient',
      },
      {
        name: 'ექსტერიერები',
        color: 'green-text-gradient',
      },
      {
        name: 'მშენებლობა',
        color: 'pink-text-gradient',
      },
    ],
    image: cottageindetails,
    source_code_link:
      'https://www.behance.net/gallery/187006515/Two-sottages',
  },
  {
    name: 'ინტერიერი კლიენტისთვის',
    description:
      'ინტერიერის ვიზუალიზაცია "ბოჰოს" სტილში, რომელიც აჩვენებს ოთახში არსებულ ატმოსფეროს შემოთავაზებული რემონტის შემდეგ. მასალების კომბინაცია მოპირკეთებაში, ავეჯსა და დეკორში, ფენებს, ფერებსა და ტექსტურებს ქმნის დინამიურ და საინტერესო სივრცეს.',
    tags: [
      {
        name: 'ინტერიერი',
        color: 'blue-text-gradient',
      },
      {
        name: 'ვიზუალიზაცია',
        color: 'green-text-gradient',
      },
      {
        name: 'corona_render',
        color: 'pink-text-gradient',
      },
    ],
    image: interior,
    source_code_link:
      'https://www.behance.net/gallery/181745155/kvartira-v-stile-BOHO',
  },
  {
    name: 'სამზარეულოს მოდელირება',
    description:
      'სამზარეულოს ავეჯის მოდელირება რეალური ოთახის ნახატებისა და გაზომვების საფუძველზე. მასალების შერჩევა და მათი შესწავლა კლიენტის ინტერიერში. სამზარეულოს ინტერიერში ძვირადღირებული ავეჯის დაყენების საბოლოო შედეგის გააზრება, ასევე სივრცის მკაფიო დაგეგმარება.',
    tags: [
      {
        name: 'მოდელირება',
        color: 'blue-text-gradient',
      },
      {
        name: 'ავეჯი',
        color: 'green-text-gradient',
      },
      {
        name: 'სამზარეულო',
        color: 'pink-text-gradient',
      },
      {
        name: '3d_განვითარება',
        color: 'red-text-gradient',
      },
    ],
    image: kitchen,
    source_code_link:
      'https://www.behance.net/gallery/172495263/kuhnja-v-svetlyh-tonah',
  },
];

const contact_text = {
  place_order: 'ან განათავსეთ თქვენი შეკვეთა Upwork-ზე ან სხვა პლატფორმაზე...',
  alert_message_sent: 'Გმადლობთ. რაც შეიძლება მალე დაგიბრუნდები.',
  alert_message_wrong: 'Რაღაც არასწორად წავიდა.',
  get_in_touch: 'Შემეხმიანე',
  contact_text: 'კონტაქტი.',
  form_your_name: 'Თქვენი სახელი',
  form_your_name_placeholder: 'Რა გქვია?*',
  form_your_email: 'Თქვენი ელ. ფოსტა',
  form_your_email_placeholder: 'რა არის შენი იმეილი?*',
  form_your_message: 'Თქვენი შეტყობინება',
  form_your_message_placeholder: 'რა არის თქვენი მოთხოვნა?*',
  form_sending_message: 'იგზავნება...',
  form_sent_message: 'გაგზავნა',
  form_title_whatsup: 'ესაუბრეთ ჩემთან WhatsUp-ზე!',
  form_title_telega: 'ესაუბრეთ ჩემთან Telegram-ზე!',
};

const toglerTexts = ['Email...', 'Upwork, Behance და ა.შ.']

const platforms = [
  {
    name: 'Upwork',
    icon: upworkIcon,
    link: 'https://www.upwork.com/freelancers/~01d0f2bad182092161?mp_source=share'
  },
  {
    name: 'Behance',
    icon: behanceIcon,
    link: 'https://www.behance.net/natatulia',
  },
  {
    name: 'LinkedIn',
    icon: linkedinIcon,
    link: 'https://www.linkedin.com/in/наталья-матвеева-5b77912a2'
  },
  {
    name: 'Kwork',
    icon: kworkIcon,
    link: ''
  },
];

export default {
  contact_text,
  herotext,
  intro,
  navLinks,
  services,
  technologies,
  technologiesHeader,
  experiences,
  testimonials,
  projects,
  experience_header,
  testimonials_text,
  work_text,
  toglerTexts,
  platforms
};
